iter3/throughput-stress-tests/test-throughput-1000RPS-report/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 1904104,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 25.943238394541275,
    "medianResTime" : 21.0,
    "minResTime" : 0.0,
    "maxResTime" : 3211.0,
    "pct1ResTime" : 39.0,
    "pct2ResTime" : 46.0,
    "pct3ResTime" : 80.0,
    "throughput" : 3172.523184479478,
    "receivedKBytesPerSec" : 904.6648143242261,
    "sentKBytesPerSec" : 334.6020546130699
  },
  "HTTP Request" : {
    "transaction" : "HTTP Request",
    "sampleCount" : 1904104,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 25.943238394541275,
    "medianResTime" : 21.0,
    "minResTime" : 0.0,
    "maxResTime" : 3211.0,
    "pct1ResTime" : 39.0,
    "pct2ResTime" : 46.0,
    "pct3ResTime" : 80.0,
    "throughput" : 3172.523184479478,
    "receivedKBytesPerSec" : 904.6648143242261,
    "sentKBytesPerSec" : 334.6020546130699
  }
}