iter3/throughput-stress-tests/test-throughput-100RPS-report/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 1818432,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 30.372452750501743,
    "medianResTime" : 25.0,
    "minResTime" : 0.0,
    "maxResTime" : 4746.0,
    "pct1ResTime" : 53.0,
    "pct2ResTime" : 62.0,
    "pct3ResTime" : 95.9900000000016,
    "throughput" : 3029.7908641349986,
    "receivedKBytesPerSec" : 863.9638011009957,
    "sentKBytesPerSec" : 319.54825520173813
  },
  "HTTP Request" : {
    "transaction" : "HTTP Request",
    "sampleCount" : 1818432,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 30.372452750501743,
    "medianResTime" : 25.0,
    "minResTime" : 0.0,
    "maxResTime" : 4746.0,
    "pct1ResTime" : 53.0,
    "pct2ResTime" : 62.0,
    "pct3ResTime" : 95.9900000000016,
    "throughput" : 3029.7908641349986,
    "receivedKBytesPerSec" : 863.9638011009957,
    "sentKBytesPerSec" : 319.54825520173813
  }
}